{
    "podcast_details": {
        "podcast_title": "Joyce Meyer Enjoying Everyday Life® Radio Podcast",
        "episode_title": "Leaving the City of Regret – Part 1",
        "episode_image": "https://ssl-static.libsyn.com/p/assets/5/9/5/0/595024eaaa8faa3140be95ea3302a6a1/JMM_Radio_logo2.jpg",
        "episode_transcript": " Welcome to Enjoying Everyday Life with New York Times bestselling author Joyce Meyer. On today's program, Joyce will be teaching from her series, The Fearsome Four. When we feel discouraged, defeated, or overwhelmed by the pressures of life, chances are we're being hit by what Joyce calls the fearsome four. Fear, guilt, worry, and insecurity. The devil uses these obstacles to keep us from God's calling, but with Christ, we can defeat all of them and reach God's perfect plan for our life. Be empowered with today's teaching and learn to embrace God's fearless four. Peace, confidence, love, and courage. Now here's Joyce with today's teaching. Father, thank you for the word today. I'm excited to share about how we don't have to live under guilt and condemnation. Jesus name, amen. Jesus, Jesus, Jesus. I said last night I'm talking about the, I'm just calling this series, The Fearsome Four, because I believe in each one of these things that I'm talking about this weekend. Fear is involved. The first one last night we talked about was fear itself. Today we're going to talk about guilt. One of the other two meetings left, we're going to talk about worry and one of them insecurity. I haven't decided exactly which one I'm going to do tonight and which one tomorrow yet, but we need them all, don't we? There's probably nobody that doesn't need teaching on fear, keeping worry out of your life, guilt, and insecurity. How many of you experience guilt in your life and it's a heavy burden that you just are fed up with and you want to learn how to live on the other side of that? Well, I had a massive, massive, terrible problem with guilt in my life. And I can stand here today and say that although it was a tremendous fight and required a lot of study, I have been delivered, completely delivered from guilt and condemnation. Now that doesn't mean when I do something wrong that I don't grieve over my mistake. I don't want to do wrong things. I don't like it at all when I feel like I've hurt the heart of God. But I think there's a difference in having a healthy grief that you have offended the heart of God, admitting it, talking it through with God, getting your forgiveness and moving on. That's a totally different thing than carrying around this terrible burden of guilt and letting it drag you down and steal your life day after day after day after day. And I've prayed very diligently about this session this morning because I'm going to try to really teach you some things that I hope is going to help you take a different look at sin. I believe that guilt is mainly caused because of the way we think about God's expectations and the way we think about sin and its remedy. Our thoughts are involved in every problem that we have. Do you know that? The way we think about things is involved in every problem that we have. That's why over and over and over in the Word of God, we're taught to meditate on the Word because if we learn to think the way God thinks, then things are going to turn around in our life. We have to learn how to think right. And you do have a certain attitude towards sin, and we all have a certain attitude toward what we think God expects of us, and then if we don't meet those expectations, we automatically feel bad. Well, God told me one time, He said, you know, Joyce, I'm not nearly as hard to get along with as you think I am. Now, that's good news for somebody here today. God is not nearly as hard to get along with as you think He is, and I have more news for you. God is not the least bit surprised by you or your behavior. He's not shocked. He's not put off. It's not something He wasn't expecting. He knew everything about you when He invited you to come into relationship with Him, and He's committed to work with you through the whole process if you just won't give up. And one of the reasons why getting rid of this heavy burden of guilt every time we do something wrong is so important is simply because if you keep that burden, you have no energy to try to learn and grow and serve God. It doesn't do one bit of good. So, God, I pray that you'll help me today. Preach this in a way that people can really understand it. First thing I want to say is that some of you need to, you need to get a new address. You need to move out of the city of regret and learn how to live in the kingdom of God. I'm going to read you a little story called, Leaving the City of Regret. It's a little bit lengthy, but I'll do a little teaching along the way. I had not really planned on taking a trip this time of the year, and yet I found myself packing rather hurriedly. This trip was going to be unpleasant, and I knew it in advance that no real good would come of it. I'm talking about my annual guilt trip. By the way, this was written by a man named Larry Harp just to give credit where credit's due. I got tickets to fly there on wish I had airlines. It was an extremely short flight. I got my baggage, which I could not check. I chose to carry it myself all the way there. It was weighted down with a thousand memories of what might have been. No one greeted me as I entered the terminal to the Regret City International Airport. I say international because you see people from all over the world live in this dismal town. As I checked into the last resort hotel, I noticed that they were going to be hosting this year's most important event, the annual pity party. Well, I wasn't going to miss that great social occasion because most of the leading citizens would be there. First attending would be the done family. You know, should have done, would have done, and could have done. Then came the I had family. You know, old wish I had and his clan. And then of course, the opportunities would be there, missed opportunities and lost opportunities. But the biggest family, the biggest clan of all would be the yesterdays. There are far too many of them to count, but each one had a very sad story to tell. Then shattered dreams would surely make an appearance, and it's their fault, would regale us with stories and excuses about how things had failed in their life. Each one would be loudly applauded by don't blame me and I couldn't help it. You getting this? Well, to make a long story short, I went to this depressing party knowing that there would be no real benefit in doing it. Now, that deserves a sealer right there. You know when I finally stopped feeling sorry for myself, when I finally realized it wasn't doing me one bit of good? And I think one of the things that really helped me get over my guilt trips that I took on a daily basis was realizing it was totally completely useless. It did not help me behave any better. If anything, all it did was break the heart of God and make me act worse. As usual, I became very depressed, but as I thought about all the stories of failures brought back from the past, it occurred to me that all of this trip and subsequent pity parties could be canceled by me and me alone. Jesus has done everything for us that he's going to do. He's waiting for us to believe it. And I'm going to show you evidence in the Word of God today that he has not only forgiven our sins, but he has removed the guilt. It's up to us whether we're going to believe it or not and stop living by how we feel, but start living by the Word of God. I started to realize that I didn't have to be there. I didn't have to be depressed. One thing kept going through my mind. I can't change yesterday, but I do have the power to make today a wonderful day. Maybe you did something wrong yesterday, and if you don't have revelation of what I'm talking about today, you may have brought your sack of guilt to this meeting with you today. And you might set it under your seat and forget about it just for a little while while I'm preaching to you, but sure as I'm standing here, you'll pick it up and take it home with you. But we want you to get rid of that. I can be happy, joyous, fulfilled, encouraged. I can be encouraging. Knowing this, I left the city of regret immediately and left no forwarding address. Am I sorry for my mistakes? Yes, but there's no physical way to undo them. So if you're planning a trip back to the city of regret, please cancel your reservations. Instead, take a trip to a new place called Starting Again. I liked it so much that I've taken up permanent residence there now. My neighbors, the I Forgive Myselfs and the New Starts have been very helpful to me. Come on. By the way, you don't have to carry around any heavy baggage there. The load has been lifted from your shoulders. God bless you as you search for this new town. If you find it, please look me up. I live on I Can Do It Street. Now, you know, guilt enters as a thought, creates a feeling, and we live by that feeling. Just like I said last night about fear, it comes in as a thought, creates a feeling. We can't always do anything about the feelings that we have, but we're more than feelings. You're so much more than feelings. And the truth is, is you don't have to make decisions based on your feelings. And if you're smart, you won't even believe your feelings. You'll even say, I don't care how I feel. This is what I know. And when you begin to live by the Word of God and what you know instead of how you feel, guess what? Your feelings will change and begin to line up with the Word. When I finally saw how Satan had stolen from me through guilt that was really false guilt because I had repented, asked God to forgive me, and even believed that he had forgiven me. And yet I would still go around and feel guilty and bad, and I carried that burden on my back everywhere that I went. I did not feel right if I didn't feel wrong. I want to say it again. I did not feel right if I didn't feel wrong. I began to almost think that that was the religious way to feel like an old worm and somebody that just could never do it right and please God. And every morning when I would go to have my prayer and time with God, I would go over one of two things, all of my problems and all of my mistakes. Oh God, I'm so sorry. God, I'm sorry. I'm sorry, I'm sorry. God, I know I'm a mess. I'm so sorry, sorry, sorry, sorry. But you know the Bible says ask and receive that your joy may be full. I was asking, but I never took the time to stop and receive. And I'd like to encourage you from now on when you ask God to forgive your sins for anything that you've done wrong, take a moment and say, and I receive your forgiveness right now. Don't just ask, but ask and receive. Why? That you can take that next step so your joy can be full. One morning as I was doing my regular routine, I really remember the Lord speaking to me and saying, are you going to fellowship with me this morning? Are your problems and your sins? Do you spend more time with your sins than you do with God? Do you spend more time thinking about what you've done wrong than what he's done right? Where sin does abound, grace does much more abound. Thanks for listening. Overcome anxiety and worry while discovering God's peace for your life with today's offer Joyce's books, the answer to anxiety and worry free living. These hardcover books are available now for a donation of $30 or more in US funds. And we do accept all major credit cards. You can order today's offer from our website, joycemeyer.org, or you can call us toll free at 1-800-789-0089. Again the number is 1-800-789-0089. Get your daily dose of encouragement with the Joyce Meyer Ministries app. Catch up on seven days of enjoying everyday life episodes. Grow deeper in God's word with the daily devotional and question of the day. And enjoy all your favorite teachings from Joyce in your digital library. Find all this and more with the Joyce Meyer Ministries app. Search Joyce Meyer in your app store and download it today. Thanks again for listening to enjoying everyday life. Our mission here at Joyce Meyer Ministries is simple, sharing Christ and loving people. Remember together we can do more."
    },
    "podcast_summary": "In this podcast, Joyce Meyer discusses the fearsome four that can hinder our lives: fear, guilt, worry, and insecurity. She emphasizes that God is not surprised by our behavior and is committed to working with us through our mistakes. Joyce shares her personal struggle with guilt and how she learned to live without the burden of guilt and condemnation. She encourages listeners to change their perspective on sin and God's expectations, and to live in the kingdom of God, free from regret. Joyce also highlights the importance of living by the Word of God rather than our feelings. The podcast concludes by mentioning resources available for overcoming anxiety and worry.",
    "podcast_guest": "Pauline Joyce Meyer (née Hutchison; June 4, 1943) is an American Charismatic Christian author, speaker, and president of Joyce Meyer Ministries.  Joyce and her husband, Dave, have four grown children and live outside St. Louis, Missouri. Her ministry is headquartered near the St. Louis suburb of Fenton, Missouri.",
    "podcast_highlights": "- Highlight 1 of the podcast: \"Although it was a tremendous fight and required a lot of study, I have been delivered, completely delivered from guilt and condemnation.\"\n- Highlight 2 of the podcast: \"God is not nearly as hard to get along with as you think He is, and I have more news for you. God is not the least bit surprised by you or your behavior.\"\n- Highlight 3 of the podcast: \"One of the reasons why getting rid of this heavy burden of guilt every time we do something wrong is so important is simply because if you keep that burden, you have no energy to try to learn and grow and serve God.\"\n- Highlight 4 of the podcast: \"I didn't have to be depressed... I can be happy, joyous, fulfilled, encouraged.\"\n- Highlight 5 of the podcast: \"When I finally saw how Satan had stolen from me through guilt that was really false guilt because I had repented, asked God to forgive me, and even believed that he had forgiven me.\"",
    "podcast_chapters": "- Title: Embracing God's Fearless Four\n- Chapter 1: The Fearsome Four: Fear\n- Chapter 2: The Fearsome Four: Guilt\n- Chapter 3: The Fearsome Four: Worry and Insecurity"
}